src/InformationRegisters/Профосмотры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>Профосмотры</Name>
			<Comment>Хранит историю проведения и планирования профосмотров</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаЗапланированная</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Comment>Статус</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПрофосмотров</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Сделка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сделки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредварительнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Событие</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОтказа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныОтменыЗаписи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Прием</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправившийВрач</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторЗаписи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаНаправления</Name>
					<Comment>Причина направления к врачу</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаПереноса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныОтменыЗаписи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Длительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Специализация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Специализации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОсмотра</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОсмотров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ИнтервалыЛистаОжидания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИнтервалыЛистаОжидания</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодДняСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодДня</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПериодыДня</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ПериодыДня.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ПериодыДня</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВесьДень</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Утро</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Вечер</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/InformationRegisters/Профосмотры/Forms/ФормаЗаписиВЛистОжидания/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - При создании на сервере.
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Сотрудник", ЭтотОбъект.Сотрудник);
	Параметры.Свойство("Контрагент", ЭтотОбъект.Контрагент);
	Параметры.Свойство("СтруктурнаяЕдиница", ЭтотОбъект.СтруктурнаяЕдиница);
	Параметры.Свойство("ДатаНачалаПериода", ЭтотОбъект.ЖелаемаяДатаНачало);
	Параметры.Свойство("ДатаОкончанияПериода", ЭтотОбъект.ЖелаемаяДатаОкончание);
	
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.СтруктурнаяЕдиница) Тогда
		ЭтотОбъект.СтруктурнаяЕдиница = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
	КонецЕсли;
	
	ЗаполнитьТаблицуСРасписаниемНаСервере();
    СоздатьЭлементыРасписанияНаСервере(Истина);
	
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();
	
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
// Процедура - Желаемая дата начало при изменении.
//
Процедура ЖелаемаяДатаНачалоПриИзменении(Элемент)
	
	РазблокироватьФлаги = Истина;
	Если ЗначениеЗаполнено(ЭтотОбъект.ЖелаемаяДатаНачало) Тогда
		
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ЖелаемаяДатаОкончание) Тогда
			ЭтотОбъект.ЖелаемаяДатаОкончание = ЭтотОбъект.ЖелаемаяДатаНачало;	
		ИначеЕсли ЭтотОбъект.ЖелаемаяДатаНачало > ЭтотОбъект.ЖелаемаяДатаОкончание Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Начало периода не может быть больше его окончания.");
			ЭтотОбъект.ЖелаемаяДатаНачало = ЭтотОбъект.ЖелаемаяДатаОкончание;
		КонецЕсли;
		
		РазблокироватьФлаги = Ложь;
		
	КонецЕсли;
	
	ИзменитьДоступностьКолонокПоВхождениюДнейНеделиВИнтервал(РазблокироватьФлаги);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Желаемая дата окончание при изменении.
//
Процедура ЖелаемаяДатаОкончаниеПриИзменении(Элемент)
	
	РазблокироватьФлаги = Истина;
	Если ЗначениеЗаполнено(ЭтотОбъект.ЖелаемаяДатаОкончание) Тогда
			
		Если ЭтотОбъект.ЖелаемаяДатаОкончание < ЭтотОбъект.ЖелаемаяДатаНачало Тогда		
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Окончание периода не может быть меньше его начала.");
			ЭтотОбъект.ЖелаемаяДатаОкончание = ЭтотОбъект.ЖелаемаяДатаНачало;
		КонецЕсли;
		РазблокироватьФлаги = Ложь;
		
	КонецЕсли;
	
	ИзменитьДоступностьКолонокПоВхождениюДнейНеделиВИнтервал(РазблокироватьФлаги);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Контрагент авто подбор.
//
Процедура КонтрагентАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Не ЗначениеЗаполнено(Текст);
	
	Если СтрДлина(Текст) >= 3 Тогда
		
		ДанныеВыбора = ОбщегоНазначенияСтоматология.НайтиКонтрагентовПоСтроке(Текст, 10, Истина, Истина);
		
	Иначе
		
		СписокКонтрагентов = Новый СписокЗначений;
		СписокКонтрагентов.Добавить(Неопределено, "Для поиска необходимо ввести 3 и более символа.");		
		ДанныеВыбора = СписокКонтрагентов;
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
// Процедура - Контрагент окончание ввода текста.
//
Процедура КонтрагентОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;	
	ДанныеВыбора = ОбщегоНазначенияСтоматология.НайтиКонтрагентовПоСтроке(Текст, , Истина, Истина);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Контрагент начало выбора.
//
Процедура КонтрагентНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораКонтрагента", ЭтотОбъект, Новый Структура("Элемент", Элемент));
	ПараметрыОткрытия = Новый Структура("ТекущаяСтрока, СтрокаПоиска", ЭтотОбъект.Контрагент, Элемент.ТекстРедактирования);	
	ОткрытьФорму("Справочник.Контрагенты.Форма.ФормаВыбораКлиенты", ПараметрыОткрытия, ЭтаФорма,,,, Оповещение);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура, Сохраняет выбранные интервалы и закрывает форму.
//
Процедура СохранитьИЗакрыть(Команда)
	
	ИнтервалыСохранены = СохранитьВыбранныеИнтервалы();	
	
	Если ИнтервалыСохранены Тогда
		Оповестить("ОбновлениеРабочегоСтола");
		ЭтаФорма.Закрыть();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
// Процедура, изменяет доступность колонок в соответствии с наличием дней недели в выбранном интервале.
//
Процедура ИзменитьДоступностьКолонокПоВхождениюДнейНеделиВИнтервал(РазблокироватьФлаги = Ложь)
	
	КоличествоДнейВИнтервалеПред = ЭтотОбъект.КоличествоДнейВИнтервале;
	
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ЖелаемаяДатаНачало) ИЛИ НЕ ЗначениеЗаполнено(ЭтотОбъект.ЖелаемаяДатаОкончание) Тогда
		ЭтотОбъект.КоличествоДнейВИнтервале = 7;
	Иначе
		ЭтотОбъект.КоличествоДнейВИнтервале = 1+ (ЭтотОбъект.ЖелаемаяДатаОкончание - ЭтотОбъект.ЖелаемаяДатаНачало) / (60*60*24);
	КонецЕсли;
	
	Если РазблокироватьФлаги = Истина ИЛИ ЭтотОбъект.КоличествоДнейВИнтервале >= 7 Тогда
		
		Для Каждого КолонкаФлагов Из Элементы.ГруппаРаписаниеОбщаяГруппа_ПраваяЧасть.ПодчиненныеЭлементы Цикл
			КолонкаФлагов.ТолькоПросмотр = Ложь;				
		КонецЦикла;
		
		ВсяНеделяБылаДоступна = Элементы.ГруппаРаписание_Колонка_ВсяНеделя.ТолькоПросмотр = Ложь;		
		Элементы.ГруппаРаписание_Колонка_ВсяНеделя.ТолькоПросмотр = Ложь;
			
		// Если в строках отмечен флаг "Вся неделя" и мы расширили интервал,
		// то в тех колонках, где ранее ТолькоПросмотр был Истина, а сейчас стал Ложь, установим флаги.
		// Будем проверять только если раннее интервал был меньше 7 дней (значит были заблокированные колонки)
		// и колонка "Вся неделя" была доступна.
		Если КоличествоДнейВИнтервалеПред < 7 И ВсяНеделяБылаДоступна Тогда
			
			Для НомерСтроки = 1 По ЭтотОбъект.Расписание.Количество()-1 Цикл
				Если ЭтотОбъект.Расписание[НомерСтроки].ВсяНеделя = Истина Тогда	
					ОтметитьВсеФлагиПоПараметрам(НомерСтроки, Неопределено, 2, Истина, Ложь);	
				КонецЕсли;				
			КонецЦикла;

		КонецЕсли;
		
	Иначе
		
		МассивДатПоДнямНедели = ПроверитьИВернутьМассивВхожденияДнейНеделиВИнтервал(ЭтотОбъект.ЖелаемаяДатаНачало, ЭтотОбъект.ЖелаемаяДатаОкончание);			
		МассивДатПоДнямНедели.Вставить(1, Новый Структура("ДеньНедели, МассивДат, Количество", "ВсяНеделя", Неопределено, ЭтотОбъект.КоличествоДнейВИнтервале-1));		
		
		Для Каждого КолонкаДняНедели Из МассивДатПоДнямНедели Цикл
			
			БлокироватьДляИзменения = КолонкаДняНедели.Количество = 0;			
			Элементы["ГруппаРаписание_Колонка_" + КолонкаДняНедели.ДеньНедели].ТолькоПросмотр = БлокироватьДляИзменения;	
			
			// Если отмечена вся неделя и мы разблокируем какую-либо колонку, то поставим в ней флаг. 
			
			Для Каждого СтрокаТ Из ЭтотОбъект.Расписание Цикл
				Если БлокироватьДляИзменения Тогда
					СтрокаТ[КолонкаДняНедели.ДеньНедели] = Ложь;
				ИначеЕсли СтрокаТ.ВсяНеделя = Истина Тогда
					СтрокаТ[КолонкаДняНедели.ДеньНедели] = Истина;	
				КонецЕсли;
			КонецЦикла;		
	
		КонецЦикла;
			
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура, Проверяет и сохраняет в регистр выбранные интервалы.
//
Функция СохранитьВыбранныеИнтервалы()
		
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ЖелаемаяДатаНачало) ИЛИ НЕ ЗначениеЗаполнено(ЭтотОбъект.ЖелаемаяДатаОкончание) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо выбрать дату записи.");
		Возврат Ложь;

	ИначеЕсли НЕ ЗначениеЗаполнено(ЭтотОбъект.Сотрудник) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо выбрать сотрудника.");
		Возврат Ложь;

	ИначеЕсли НЕ ЗначениеЗаполнено(ЭтотОбъект.Контрагент) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо выбрать пациента.");
		Возврат Ложь;
		
	ИначеЕсли ЭтотОбъект.ЖелаемаяДатаОкончание < НачалоДня(ТекущаяДатаСеанса()) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо выбрать дату записи равную или больше текущей.");
		Возврат Ложь;	

	КонецЕсли;
	
	ТаблицаЗначенийРасписание = ЭтотОбъект.Расписание.Выгрузить();

	Если ТаблицаЗначенийРасписание.Найти(Истина) = Неопределено Тогда		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо выбрать период дня или день недели.");
		Возврат Ложь;		
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.ИнтервалыЛистаОжидания.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.СтруктурнаяЕдиница.Установить(ЭтотОбъект.СтруктурнаяЕдиница); 
	НаборЗаписей.Отбор.Контрагент.Установить(ЭтотОбъект.Контрагент);
	НаборЗаписей.Отбор.Сотрудник.Установить(ЭтотОбъект.Сотрудник);
	
	МассивДатПоДнямНеделям = ПроверитьИВернутьМассивВхожденияДнейНеделиВИнтервал(ЭтотОбъект.ЖелаемаяДатаНачало, ЭтотОбъект.ЖелаемаяДатаОкончание);
	
	ИтераторНабораЗаписей = 0;
	
	ДатаЗаписи = ТекущаяДатаСеанса();
	
	Для Каждого ЭлементМассиваДат Из МассивДатПоДнямНеделям Цикл
		
		// Если на этот день нет ни одной галочки, то идти дальше нет смысла.
		Если ЭлементМассиваДат.Количество = 0 ИЛИ ТаблицаЗначенийРасписание.Итог(ЭлементМассиваДат.ДеньНедели) = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого ДатаИнтервала Из ЭлементМассиваДат.МассивДат Цикл
						
			МассивПериодовДня = Новый Массив;
			МассивИтераторовПрохода = Новый Массив;
			
			Для НомерСтрокиТЧ = 0 По ЭтотОбъект.Расписание.Количество()-1 Цикл
					
				ЭтоФлагВыбораПолногоДня = (НомерСтрокиТЧ = 0);
				
				Если (ЭтоФлагВыбораПолногоДня И ЭтотОбъект.Расписание[0][ЭлементМассиваДат.ДеньНедели] = Истина)
					ИЛИ (НЕ ЭтоФлагВыбораПолногоДня И ЭтотОбъект.Расписание[НомерСтрокиТЧ][ЭлементМассиваДат.ДеньНедели] = Истина) Тогда 
					
					НоваяЗапись = НаборЗаписей.Добавить(); 
					НоваяЗапись.СтруктурнаяЕдиница = ЭтотОбъект.СтруктурнаяЕдиница; 
					НоваяЗапись.Контрагент = ЭтотОбъект.Контрагент; 
					НоваяЗапись.Сотрудник = ЭтотОбъект.Сотрудник;
					НоваяЗапись.Комментарий = ЭтотОбъект.Комментарий;
					НоваяЗапись.Дата = ДатаИнтервала;
					НоваяЗапись.ДатаЗаписи = ДатаЗаписи;
					НоваяЗапись.ПериодДня = ?(ЭтоФлагВыбораПолногоДня, Перечисления.ПериодыДня.ВесьДень, ЭтотОбъект.Расписание[НомерСтрокиТЧ].НаименованиеИнтервала);
					НоваяЗапись.ПериодДняСтрокой = НоваяЗапись.ПериодДня;
					
					ИтераторНабораЗаписей = ИтераторНабораЗаписей + 1;
					
					Если ЭтоФлагВыбораПолногоДня Тогда
						Прервать;
					КонецЕсли;
					
					МассивИтераторовПрохода.Добавить(ИтераторНабораЗаписей-1);
					МассивПериодовДня.Добавить(НоваяЗапись.ПериодДня);
						
				КонецЕсли;
				
			КонецЦикла; // Строки ТЧ Расписание.
			
			Если МассивИтераторовПрохода.Количество() > 1 Тогда
				ПериодДняСтрокой = СтрСоединить(МассивПериодовДня, ", ");
				Для Каждого ИтераторНабора Из МассивИтераторовПрохода Цикл
					НаборЗаписей[ИтераторНабора].ПериодДняСтрокой = ПериодДняСтрокой;		
				КонецЦикла;
			КонецЕсли;
			
		КонецЦикла; // Массив дат на каждый день недели.					
	КонецЦикла; // Массив дней недели.
	
	РезультатСохранения = Ложь;
	Попытка
		НаборЗаписей.ОбменДанными.Загрузка = Истина;
		НаборЗаписей.Записать(Истина);
		РезультатСохранения = Истина;
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось запись выбранные значения."); 	
	КонецПопытки;
	
	Возврат РезультатСохранения;
	
КонецФункции

&НаСервере
// Процедура, заполняет таблицу с расписанием (на сервере).
//
Процедура ЗаполнитьТаблицуСРасписаниемНаСервере()
		
	Для Каждого ЭлементПеречисления Из Перечисления.ПериодыДня Цикл
		
		НоваяСтрока = ЭтотОбъект.Расписание.Добавить();
		НоваяСтрока.НаименованиеИнтервала = ?(ЭлементПеречисления = Перечисления.ПериодыДня.ВесьДень, Неопределено, ЭлементПеречисления);
		
	КонецЦикла;

КонецПроцедуры

&НаСервере
// Процедура, создат элементы расписания (на сервере).
//
Процедура СоздатьЭлементыРасписанияНаСервере(ПроверитьИЗаблокироватьКолонки = Ложь)
	
	БлокироватьКолонки = Ложь;
	
	Если ПроверитьИЗаблокироватьКолонки = Истина
		И ЗначениеЗаполнено(ЭтотОбъект.ЖелаемаяДатаНачало) И ЗначениеЗаполнено(ЭтотОбъект.ЖелаемаяДатаОкончание) Тогда
		
		ЭтотОбъект.КоличествоДнейВИнтервале = 1+ (ЭтотОбъект.ЖелаемаяДатаОкончание - ЭтотОбъект.ЖелаемаяДатаНачало) / (60*60*24);	
        БлокироватьКолонки = ЭтотОбъект.КоличествоДнейВИнтервале < 7;
		
	КонецЕсли;
	
	МассивКолонок = Новый Массив;
	МассивКолонок.Добавить(Новый Структура("Номер, Заголовок, ПутьККолонке, Заблокировать", 1, "Пн",	"Понедельник", Истина));
	МассивКолонок.Добавить(Новый Структура("Номер, Заголовок, ПутьККолонке, Заблокировать", 2, "Вт",	"Вторник", Истина));
	МассивКолонок.Добавить(Новый Структура("Номер, Заголовок, ПутьККолонке, Заблокировать", 3, "Ср",	"Среда", Истина));
	МассивКолонок.Добавить(Новый Структура("Номер, Заголовок, ПутьККолонке, Заблокировать", 4, "Чт",	"Четверг", Истина));
	МассивКолонок.Добавить(Новый Структура("Номер, Заголовок, ПутьККолонке, Заблокировать", 5, "Пт",	"Пятница", Истина));
	МассивКолонок.Добавить(Новый Структура("Номер, Заголовок, ПутьККолонке, Заблокировать", 6, "Сб",	"Суббота", Истина));
	МассивКолонок.Добавить(Новый Структура("Номер, Заголовок, ПутьККолонке, Заблокировать", 7, "Вс",	"Воскресенье", Истина));
	
	Если БлокироватьКолонки Тогда
		
		ПараметрыПроверки = Новый Структура("МассивДнейНедели, ПроверяемаяКолонка, НовоеЗначение", МассивКолонок, "Заблокировать", Ложь);	
		МассивКолонок = ПроверитьИВернутьМассивВхожденияДнейНеделиВИнтервал(ЭтотОбъект.ЖелаемаяДатаНачало, ЖелаемаяДатаОкончание, ПараметрыПроверки);	
		
	КонецЕсли;
	
	МассивКолонок.Вставить(0, Новый Структура("Номер, Заголовок, ПутьККолонке, Заблокировать", 0, "", "НаименованиеИнтервала", 0, Ложь));
	МассивКолонок.Вставить(1, Новый Структура("Номер, Заголовок, ПутьККолонке, Заблокировать", 0, "", "ВсяНеделя", ЭтотОбъект.КоличествоДнейВИнтервале = 1));
	
	ПараметрыСоздаваемойГруппы = Новый Структура;
	ПараметрыСоздаваемойГруппы.Вставить("ИмяЭлемента", "");
	ПараметрыСоздаваемойГруппы.Вставить("ГруппаЭлемента", "");
	ПараметрыСоздаваемойГруппы.Вставить("ШиринаГруппы", 2);
	ПараметрыСоздаваемойГруппы.Вставить("Видимость", Истина);	
	ПараметрыСоздаваемойГруппы.Вставить("ГоризонтальноеПоложениеВГруппе", ГоризонтальноеПоложениеЭлемента.Центр);
	ПараметрыСоздаваемойГруппы.Вставить("Группировка", ГруппировкаПодчиненныхЭлементовФормы.Вертикальная);
	ПараметрыСоздаваемойГруппы.Вставить("ГоризонтальныйИнтервал", ИнтервалМеждуЭлементамиФормы.Авто);
	ПараметрыСоздаваемойГруппы.Вставить("ОтображатьЗаголовок", Ложь);
	
	ПараметрыСоздаваемойДекорации = Новый Структура;
	ПараметрыСоздаваемойДекорации.Вставить("ИмяЭлемента", "");
	ПараметрыСоздаваемойДекорации.Вставить("ГруппаЭлемента", "");
	ПараметрыСоздаваемойДекорации.Вставить("Ширина", 2);
	ПараметрыСоздаваемойДекорации.Вставить("Заголовок", "");
	ПараметрыСоздаваемойДекорации.Вставить("Подсказка", "");
	ПараметрыСоздаваемойДекорации.Вставить("РастягиватьПоГоризонтали", Ложь);		
	
	ПараметрыСоздаваемогоФлага = Новый Структура;
	ПараметрыСоздаваемогоФлага.Вставить("ИмяЭлемента", "");
	ПараметрыСоздаваемогоФлага.Вставить("ИмяРеквизитаДанных", "");
	ПараметрыСоздаваемогоФлага.Вставить("ГруппаЭлемента", "");	
	ПараметрыСоздаваемогоФлага.Вставить("Подсказка", "");
	ПараметрыСоздаваемогоФлага.Вставить("ГоризонтальноеПоложениеЭлемента", ГоризонтальноеПоложениеЭлемента.Центр);		
	ПараметрыСоздаваемогоФлага.Вставить("ОбработчикПриИзменении", "Подключаемый_ОбработатьНажатиеФлага");
		
	// Левая часть блока с интервалами и флагами "Вся неделя".
	ПараметрыСоздаваемойГруппы.ИмяЭлемента		= "РаписаниеОбщаяГруппа_ЛеваяЧасть";
	ПараметрыСоздаваемойГруппы.ШиринаГруппы		= 0;	
	ПараметрыСоздаваемойГруппы.ГруппаЭлемента	= Элементы.РасписаниеДинамическое;		
	ПараметрыСоздаваемойГруппы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	ПараметрыСоздаваемойГруппы.ГоризонтальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Авто;
	ОбщаяГруппаЛеваяЧасть = УправлениеИнтерфейсамиСервер.СоздатьЭлементГруппа(ЭтаФорма, ПараметрыСоздаваемойГруппы, Ложь);
		
	// Правая часть блока с днями недели.
	ПараметрыСоздаваемойГруппы.ИмяЭлемента		= "РаписаниеОбщаяГруппа_ПраваяЧасть";
	ПараметрыСоздаваемойГруппы.ШиринаГруппы		= 0;	
	ПараметрыСоздаваемойГруппы.ГруппаЭлемента	= Элементы.РасписаниеДинамическое;
	ПараметрыСоздаваемойГруппы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	ПараметрыСоздаваемойГруппы.ГоризонтальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Полуторный;
	ОбщаяГруппаПраваяЧасть = УправлениеИнтерфейсамиСервер.СоздатьЭлементГруппа(ЭтаФорма, ПараметрыСоздаваемойГруппы, Ложь);
	ОбщаяГруппаПраваяЧасть.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Полуторный;
	
	Для Каждого КолонкаБлока Из МассивКолонок Цикл
				
		ЭтоНаименованиеИнтервала = (КолонкаБлока.ПутьККолонке = "НаименованиеИнтервала");	
		ГруппаСоздаваемогоЭлемента = ?((ЭтоНаименованиеИнтервала ИЛИ КолонкаБлока.ПутьККолонке = "ВсяНеделя"), ОбщаяГруппаЛеваяЧасть, ОбщаяГруппаПраваяЧасть); 
		
		ПараметрыСоздаваемойГруппы.ИмяЭлемента		= "Раписание_Колонка_" + КолонкаБлока.ПутьККолонке;
		ПараметрыСоздаваемойГруппы.ШиринаГруппы		= 0;	
		ПараметрыСоздаваемойГруппы.ГруппаЭлемента	= ГруппаСоздаваемогоЭлемента;
		ПараметрыСоздаваемойГруппы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная; 
		ПараметрыСоздаваемойГруппы.ГоризонтальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Одинарный;
		ГруппаКолонка = УправлениеИнтерфейсамиСервер.СоздатьЭлементГруппа(ЭтаФорма, ПараметрыСоздаваемойГруппы, Ложь);	
		ГруппаКолонка.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Одинарный;
		ГруппаКолонка.ТолькоПросмотр = БлокироватьКолонки И КолонкаБлока.Заблокировать;
				
		Для НомерСтрокиТаблицы = 0 По ЭтотОбъект.Расписание.Количество()-1 Цикл
			
			ПараметрыСоздаваемойГруппы.ИмяЭлемента		= СтрШаблон("РасписаниеКонтейнер_%1_%2", КолонкаБлока.ПутьККолонке, НомерСтрокиТаблицы);
			ПараметрыСоздаваемойГруппы.ШиринаГруппы		= 0;	
			ПараметрыСоздаваемойГруппы.ГруппаЭлемента	= ГруппаКолонка; 
			ГруппаКонтейнерЭлемента = УправлениеИнтерфейсамиСервер.СоздатьЭлементГруппа(ЭтаФорма, ПараметрыСоздаваемойГруппы, Ложь);		
			
			Если ЭтоНаименованиеИнтервала Тогда
				
				ГруппаКонтейнерЭлемента.ГоризонтальноеПоложениеПодчиненных = ГоризонтальноеПоложениеЭлемента.Право;
								
				ПараметрыСоздаваемойДекорации.ИмяЭлемента		= "РасписаниеНаименованиеИнтервала_" + НомерСтрокиТаблицы;
				ПараметрыСоздаваемойДекорации.Заголовок			= ЭтотОбъект.Расписание[НомерСтрокиТаблицы].НаименованиеИнтервала;
				ПараметрыСоздаваемойДекорации.Ширина			= 7;
				ПараметрыСоздаваемойДекорации.ГруппаЭлемента	= ГруппаКонтейнерЭлемента;		
				ПараметрыСоздаваемойДекорации.Вставить("ЦветТекста", ЦветаСтиля.ЦветАкцента);
				ДекорацияНаименованиеИнтервала = УправлениеИнтерфейсамиСервер.СоздатьЭлементДекорация(ЭтаФорма, ПараметрыСоздаваемойДекорации);
				ДекорацияНаименованиеИнтервала.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Право;
				ДекорацияНаименованиеИнтервала.Высота = 0;
				
			Иначе
				
				ГруппаКонтейнерЭлемента.Ширина = 2;
				
				ПараметрыСоздаваемогоФлага.ИмяЭлемента			= СтрШаблон("РасписаниеЭлемент_Флаг_%1_%2", КолонкаБлока.Номер, НомерСтрокиТаблицы);
				ПараметрыСоздаваемогоФлага.ИмяРеквизитаДанных	= "Расписание["+ НомерСтрокиТаблицы + "]." + КолонкаБлока.ПутьККолонке;
				ПараметрыСоздаваемогоФлага.ГруппаЭлемента		= ГруппаКонтейнерЭлемента;		
				ЭлементФлаг = УправлениеИнтерфейсамиСервер.СоздатьЭлементФлаг(ЭтаФорма, ПараметрыСоздаваемогоФлага, Ложь);		
				
			КонецЕсли;
			
			Если НомерСтрокиТаблицы = 0 Тогда
				ГруппаКонтейнерЭлемента.Высота = 3;
				ГруппаКонтейнерЭлемента.ВертикальноеПоложениеПодчиненных = ВертикальноеПоложениеЭлемента.Верх;
				ГруппаКонтейнерЭлемента.ОтображатьЗаголовок = Истина;
				ГруппаКонтейнерЭлемента.Заголовок = КолонкаБлока.Заголовок;				
			КонецЕсли;
			
		КонецЦикла; // Строки.
			
	КонецЦикла; // Колонки.
		
КонецПроцедуры 

&НаКлиенте
// Процедура, обрабатывает нажатие флага.
//
Процедура Подключаемый_ОбработатьНажатиеФлага(Элемент)
	
	// Получим флаг, на который мы нажали. Номер строится следующим образом:
	// НомерДняНедели_НомерСтроки.
	// Соответственно: Понедельник, утро = 1_1, Воскресенье, вечер = 3_7.
	// Отметка всех по горизонтали = 0_Х, а всех по вертикали = Х_0.
	// Отметка всех флагов = 0_0.
		
	ДанныеФлага = СтрРазделить(Элемент.Имя, "_", Ложь);
	
	Если ДанныеФлага.Количество() = 4 Тогда
		
		НомерДняНедели = Число(ДанныеФлага[2]);
		НомерСтроки = Число(ДанныеФлага[3]);
		
		ПредставлениеНедели = ПолучитьДеньНеделиПоЧислу(НомерДняНедели);
		
		Если НЕ НомерСтроки = 0 И НЕ НомерДняНедели = 0 Тогда
			
			// Если где-то стоит флаг на отметку всех, но в этой строке / столбце сняли один флаг, то надо снять флаг всех.
			
			Если ЭтотОбъект.Расписание[НомерСтроки]["ВсяНеделя"] = Истина Тогда
				ЭтотОбъект.Расписание[НомерСтроки]["ВсяНеделя"] = Ложь;	
			КонецЕсли;
			
			Если ЭтотОбъект.Расписание[0][ПолучитьДеньНеделиПоЧислу(НомерДняНедели)] = Истина Тогда
				ЭтотОбъект.Расписание[0][ПолучитьДеньНеделиПоЧислу(НомерДняНедели)] = Ложь;	
			КонецЕсли;
			
			// Если устанавливаем последний (в строке/столбце) флаг в истину, то проверим и включим флаг всех.
			
			ТекущееСостояние = ЭтотОбъект.Расписание[НомерСтроки][ПредставлениеНедели];
			Если ТекущееСостояние = Истина Тогда
				ОтметитьВсеФлагиПоПараметрам(НомерСтроки, НомерДняНедели, 1, ТекущееСостояние, Истина);
				Если НЕ Элементы["ГруппаРаписание_Колонка_ВсяНеделя"].ТолькоПросмотр Тогда
					ОтметитьВсеФлагиПоПараметрам(НомерСтроки, НомерДняНедели, 2, ТекущееСостояние, Истина);
				КонецЕсли;
			Иначе
				ЭтотОбъект.Расписание[0].ВсяНеделя = Ложь;
			КонецЕсли;
			
			Возврат;
			
		КонецЕсли;
		
		Если НомерСтроки = 0 И НомерДняНедели = 0 Тогда
			// Отметили все.
			
			ВариантЗаполнения = 0;
			НовоеЗначение = Расписание[0]["ВсяНеделя"];
			
		ИначеЕсли НомерСтроки = 0 Тогда
			// Отметили все по вертикали.
			
			ВариантЗаполнения = 1;
			НовоеЗначение = Расписание[0][ПолучитьДеньНеделиПоЧислу(НомерДняНедели)];
			
		Иначе
			// Отметили все по горизонтали.	
			
			ВариантЗаполнения = 2;
			НовоеЗначение = Расписание[НомерСтроки].ВсяНеделя;
			
		КонецЕсли;
				
		ОтметитьВсеФлагиПоПараметрам(НомерСтроки, НомерДняНедели, ВариантЗаполнения, НовоеЗначение);
		
	КонецЕсли;
	
КонецПроцедуры  

&НаКлиенте
// Процедура, отмечает флаги в строке/ столбце по параметрам.
//
// Параметры:
//  НомерСтроки									 - 	 Номер строки 
//  НомерДняНедели								 - 	 Номер дня недели (1 - 7) 
//  ВариантЗаполнения							 - 	 Вариант заполнения флагов (1-3) 
//  НовоеЗначение								 - 	 Новое значение флага(ов) 
//  ПроверитьИУстановитьЗначениеЯчейкиВсеФлаги	 - 	 Проверить активность флагов в строке/ столбце для установки флага всех. 
//
Процедура ОтметитьВсеФлагиПоПараметрам(НомерСтроки, НомерДняНедели, ВариантЗаполнения, НовоеЗначение, ПроверитьИУстановитьЗначениеЯчейкиВсеФлаги = Ложь)
	
	// Варианты:
	// 0 - все флаги
	// 1 - все по вертикали
	// 2 - все по горизонтали
	
	Если ВариантЗаполнения = 0 ИЛИ ВариантЗаполнения = 2 Тогда
		МассивОбрабатываемыхКолонок = Новый_Массив("ВсяНеделя", "Понедельник", "Вторник", "Среда", "Четверг", "Пятница", "Суббота", "Воскресенье");
	КонецЕсли;
	
	Если ПроверитьИУстановитьЗначениеЯчейкиВсеФлаги Тогда
		РезультатПроверки = Истина;
	КонецЕсли;
	
	Если ВариантЗаполнения = 1 Тогда
		
		ПредставлениеДняНедели = ПолучитьДеньНеделиПоЧислу(НомерДняНедели);
		
		Для НомерСтрокиТ = 1 По ЭтотОбъект.Расписание.Количество()-1 Цикл					
						
			Если ПроверитьИУстановитьЗначениеЯчейкиВсеФлаги И НЕ НомерСтрокиТ = НомерСтроки И НовоеЗначение = Истина Тогда
				РезультатПроверки = РезультатПроверки И (ЭтотОбъект.Расписание[НомерСтрокиТ][ПредставлениеДняНедели] = Истина);
				Продолжить;				
			КонецЕсли;
			
			ОтмеченаВсяНеделяСтроки = (ЭтотОбъект.Расписание[НомерСтрокиТ]["ВсяНеделя"] = Истина);
			
			Если ОтмеченаВсяНеделяСтроки Тогда				
				// ПерекрестнаяЯчейка = ТекущийФлаг;
				Если НовоеЗначение = Ложь Тогда
					// Снимать раскрашивание ячейки.
					Продолжить;
				Иначе
					// Раскрашивать ячейку! 
				КонецЕсли;
			КонецЕсли;
			
			ЭтотОбъект.Расписание[НомерСтрокиТ][ПредставлениеДняНедели] = НовоеЗначение;

		КонецЦикла; 
		
	ИначеЕсли ВариантЗаполнения = 2 Тогда
		
		Для НомерКолонкиТ = 1 По МассивОбрабатываемыхКолонок.Количество()-1 Цикл					
			
			НаименованиеКолонки = МассивОбрабатываемыхКолонок[НомерКолонкиТ];
			
			Если ПроверитьИУстановитьЗначениеЯчейкиВсеФлаги И НЕ НомерКолонкиТ = НомерДняНедели И НовоеЗначение = Истина Тогда
				ЗначениеФлага = (Элементы["ГруппаРаписание_Колонка_"+НаименованиеКолонки].ТолькоПросмотр = Истина
								 ИЛИ ЭтотОбъект.Расписание[НомерСтроки][НаименованиеКолонки] = Истина); 
				РезультатПроверки = РезультатПроверки И ЗначениеФлага;
				Продолжить;				
			КонецЕсли;
			
			Если НовоеЗначение = Истина И Элементы["ГруппаРаписание_Колонка_"+НаименованиеКолонки].ТолькоПросмотр = Истина Тогда
				Продолжить;
			КонецЕсли;
			
			ОтмеченВесьДеньКолонки = (ЭтотОбъект.Расписание[0][НаименованиеКолонки] = Истина);
			
			Если ОтмеченВесьДеньКолонки = Истина Тогда
				// ПерекрестнаяЯчейка = ТекущийФлаг;
				Если НовоеЗначение = Ложь Тогда
					// Снимать раскрашивание ячейки.
					Продолжить;
				Иначе
					// Раскрашивать ячейку!	
				КонецЕсли;
				
			КонецЕсли;
			
			ЭтотОбъект.Расписание[НомерСтроки][НаименованиеКолонки] = НовоеЗначение;
			
		КонецЦикла;	
		
	Иначе
		
		Для НомерСтрокиТ = 0 По ЭтотОбъект.Расписание.Количество()-1 Цикл								
			Для Каждого КолонкаТ Из МассивОбрабатываемыхКолонок Цикл													
				
				Если НовоеЗначение = Истина И Элементы["ГруппаРаписание_Колонка_"+КолонкаТ].ТолькоПросмотр = Истина Тогда
					Продолжить;
				КонецЕсли; 
				
				ЭтотОбъект.Расписание[НомерСтрокиТ][КолонкаТ] = НовоеЗначение;			
			КонецЦикла;					
		КонецЦикла;	
		
	КонецЕсли;
	
	Если ПроверитьИУстановитьЗначениеЯчейкиВсеФлаги И РезультатПроверки = Истина Тогда 
		
		Если ВариантЗаполнения = 1 Тогда
			ЭтотОбъект.Расписание[0][ПредставлениеДняНедели] = Истина;
		ИначеЕсли ВариантЗаполнения = 2 Тогда
			ЭтотОбъект.Расписание[НомерСтроки]["ВсяНеделя"] = Истина;		
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
// Функция, возвращает массив дат по дням неделям в выбранном интервале.
// 
Функция ПроверитьИВернутьМассивВхожденияДнейНеделиВИнтервал(НачалоПериода, ОкончаниеПериода, ПараметрыПроверки = Неопределено)
	
	//Посчитаем количество каждого дня недели в выбранном интервале и даты этих дней.
	
	ЭтоСтандартнаяПроверка = НЕ ЗначениеЗаполнено(ПараметрыПроверки);
	
	Если ЭтоСтандартнаяПроверка Тогда
		
		МассивДнейНедели = Новый Массив;
		МассивДнейНедели.Добавить(Новый Структура("ДеньНедели, МассивДат, Количество", "Понедельник", Новый Массив, 0));
		МассивДнейНедели.Добавить(Новый Структура("ДеньНедели, МассивДат, Количество", "Вторник", Новый Массив, 0));
		МассивДнейНедели.Добавить(Новый Структура("ДеньНедели, МассивДат, Количество", "Среда", Новый Массив, 0));
		МассивДнейНедели.Добавить(Новый Структура("ДеньНедели, МассивДат, Количество", "Четверг", Новый Массив, 0));
		МассивДнейНедели.Добавить(Новый Структура("ДеньНедели, МассивДат, Количество", "Пятница", Новый Массив, 0));
		МассивДнейНедели.Добавить(Новый Структура("ДеньНедели, МассивДат, Количество", "Суббота", Новый Массив, 0));
		МассивДнейНедели.Добавить(Новый Структура("ДеньНедели, МассивДат, Количество", "Воскресенье", Новый Массив, 0));	
	
	ИначеЕсли ТипЗнч(ПараметрыПроверки) = Тип("Структура") Тогда
		МассивДнейНедели = Неопределено;
		ПроверяемаяКолонка = Неопределено;
		НовоеЗначение = Неопределено;
		
		ПараметрыПроверки.Свойство("МассивДнейНедели", МассивДнейНедели);
		ПараметрыПроверки.Свойство("ПроверяемаяКолонка", ПроверяемаяКолонка);
		ПараметрыПроверки.Свойство("НовоеЗначение", НовоеЗначение);
		
	Иначе
		Возврат Новый Массив;
	КонецЕсли;
	
		
	Если НЕ ЗначениеЗаполнено(МассивДнейНедели) Тогда
		
		ЭтоПроверкаПриСозданииКолонок = Ложь;
	КонецЕсли;
	
	КоличествоДней = (ОкончаниеПериода - НачалоПериода) / (60*60*24);
	
	ОбрабатываемаяДата = НачалоПериода;
	Для Итератор = 0 По КоличествоДней Цикл
		
		ОбрабатываемаяДата = ОбрабатываемаяДата + ?(Итератор = 0, 0, (60*60*24));
		НомерДняНедели = ДеньНедели(ОбрабатываемаяДата);					
		
		Если ЭтоСтандартнаяПроверка Тогда	
			МассивДнейНедели[НомерДняНедели-1].Количество = МассивДнейНедели[НомерДняНедели-1].Количество + 1;
			МассивДнейНедели[НомерДняНедели-1].МассивДат.Добавить(ОбрабатываемаяДата);
		Иначе		
			МассивДнейНедели[НомерДняНедели-1][ПроверяемаяКолонка] = НовоеЗначение;				
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат МассивДнейНедели;
		
КонецФункции

&НаКлиентеНаСервереБезКонтекста
// Функция, получает день недели по числу.
//
// Параметры:
//  НомерДняНедели	 - 	 Номер дня недели от 1 до 7 
// 
// Возвращаемое значение:
//   - Строчное представление дня недели
//
Функция ПолучитьДеньНеделиПоЧислу(НомерДняНедели)
	
	// Дата(1,1,2) это воскресенье. Прибавляя от 1 до 7 получим представления нужного дня недели.
	Возврат ТРег(Формат(Дата(1,1,2 + НомерДняНедели), "ДФ=дддд"));
	
КонецФункции

&НаСервере
// Функция - Вернуть массив дат по дням недели запросом.
// 
Функция ВернутьМассивДатПоДнямНеделиЗапросом()
	
	МассивДатПоДнямНеделям = Новый Массив;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Дни.ДеньНедели КАК ДеньНедели,
	|	(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&НачалоПериода, ДЕНЬ, -Дни.ДеньНедели), НЕДЕЛЯ), 
	|		НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&КонецПериода, ДЕНЬ, 1 - Дни.ДеньНедели), НЕДЕЛЯ), ДЕНЬ) / 7) - 1 КАК КоличествоДней
	|ИЗ
	|    (ВЫБРАТЬ 1 КАК ДеньНедели ОБЪЕДИНИТЬ ВЫБРАТЬ 2 ОБЪЕДИНИТЬ ВЫБРАТЬ 3 ОБЪЕДИНИТЬ ВЫБРАТЬ 4 ОБЪЕДИНИТЬ ВЫБРАТЬ 5
	|    ОБЪЕДИНИТЬ ВЫБРАТЬ 6 ОБЪЕДИНИТЬ ВЫБРАТЬ 7) КАК Дни
	|СГРУППИРОВАТЬ ПО
	|	Дни.ДеньНедели
	|ИМЕЮЩИЕ
	|	СУММА((РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&НачалоПериода, ДЕНЬ, -Дни.ДеньНедели), НЕДЕЛЯ),
	|	НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&КонецПериода, ДЕНЬ, 1 - Дни.ДеньНедели), НЕДЕЛЯ), ДЕНЬ) / 7) - 1) >= 0");
		
	Запрос.УстановитьПараметр("НачалоПериода", ЭтотОбъект.ЖелаемаяДатаНачало);
	Запрос.УстановитьПараметр("КонецПериода", ЭтотОбъект.ЖелаемаяДатаОкончание);	
	
	РезультатЗапроса = Запрос.Выполнить();	
	Выборка = РезультатЗапроса.Выбрать();
	
	ОбрабатываемаяДата = ЭтотОбъект.ЖелаемаяДатаНачало;
	
	Пока Выборка.Следующий() Цикл
					
		МассивДат = Новый Массив;

		Для Итератор = 0 По Выборка.КоличествоДней Цикл			
			МассивДат.Добавить(ОбрабатываемаяДата + (Итератор * (60*60*24*7)));					
		КонецЦикла;
		
		СтруктураЗначения = Новый Структура("ДеньНедели, МассивДат, Количество", ПолучитьДеньНеделиПоЧислу(Выборка.ДеньНедели), МассивДат, Выборка.КоличествоДней);
		МассивДатПоДнямНеделям.Добавить(СтруктураЗначения);
		
		ОбрабатываемаяДата = ОбрабатываемаяДата + (60*60*24);
		
	КонецЦикла;
	
	Возврат МассивДатПоДнямНеделям;

КонецФункции

&НаКлиенте
// Процедура, обработчик события "ПослеВыбораКонтрагента" 
//
Процедура ПослеВыбораКонтрагента(Результат, ДополнительныеПараметры) Экспорт 
	
	Если Результат <> Неопределено Тогда
		ЭтотОбъект.Контрагент = Результат; 
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
